package com.liuzhen;

import com.liuzhen.app.util.StringUtils;

/**
 * @class: Test
 * @description: 
 * @author: L.zhen
 * @date: 2020/9/20 17:26
 */
public class Test {
	public static void main(String[] args) {
		String str = "\"2920，第一纪元末年\t16\"\n" + "\"卷一 晨星\t16\"\n" + "\"卷二 日晓\t20\"\n" + "\"卷三 初种\t25\"\n" + "\"卷四 雨手\t29\"\n" + "\"卷五 次种\t33\"\n" + "\"卷六 年中\t38\"\n" + "\"卷七 日高\t42\"\n" + "\"卷八 末种\t46\"\n" + "\n" + "\"卷九 炉火\t52\"\n" + "\n" + "\"卷十 霜落\t57\"\n" + "\n" + "\"卷十一 日暮\t64\"\n" + "\n" + "\"卷十二 夜星\t69\"\n" + "\n" + "\"传奇之城\t74\"\n" + "\"创世神与外来神\t76\"\n" + "\"蛋糕与钻石\t77\"\n" + "\"大坍陷\t79\"\n" + "\"沉睡净土之梦\t81\"\n" + "\"巢蠼薄饼配方\t82\"\n" + "\"苍穹\t84\"\n" + "\"不死之血\t86\"\n" + "\"查维克·科宁吉信件\t90\"\n" + "\n" + "\"卷一\t90\"\n" + "\n" + "\"卷二\t92\"\n" + "\n" + "\"卷三\t95\"\n" + "\n" + "\"卷四\t97\"\n" + "\n" + "\"刀锋卫士沉浮录\t100\"\n" + "\"盗亦有道\t103\"\n" + "\"恩处编年史\t104\"\n" + "\"对贝罗演讲的回应\t105\"\n" + "\"伐木工的妻子\t107\"\n" + "\n" + "\"卷一\t107\"\n" + "\n" + "\"费福根\t109\"\n" + "\n" + "\"卷一\t109\"\n" + "\n" + "\"卷二\t113\"\n" + "\n" + "\"卷三\t117\"\n" + "\n" + "\"风暴中的幽灵\t121\"\n" + "\"锻莫历史文化文集\t122\"\n" + "\n" + "\"卷一 马洛巴·苏尔与流行文化中的锻莫残片\t122\"\n" + "\n" + "\"第一要塞起义\t124\"\n" + "\"第三纪元大事记\t128\"\n" + "\"帝国简明史\t131\"\n" + "\n" + "\"卷一\t131\"\n" + "\n" + "\"卷二\t134\"\n" + "\n" + "\"卷三\t137\"\n" + "\n" + "\"第三道门\t142\"\n" + "\"帝国与精灵主权大战历史简介\t144\"\n" + "\"波耶西亚的荣耀\t150\"\n" + "\"N'Gasta!Kvata!Kvakis!\t151\"\n" + "\"真实与虚幻\t151\"\n" + "\"阿贝那尼特的致命一击\t152\"\n" + "\"阿斯克德人之歌\t155\"\n" + "\"阿祖拉祷文\t157\"\n" + "\"阿兹尔·特拉吉亚泽瑞\t159\"\n" + "\"远行记\t162\"\n" + "\"佩拉吉奥斯的疯狂\t166\"\n" + "\"西帝斯\t170\"\n" + "\"雷曼\t171\"\n" + "\"晨风简史\t173\"\n" + "\"晚餐中的游戏\t175\"\n" + "\"阿祖拉与宝盒\t181\"\n" + "\"锻莫的古老传说十一\t181\"\n" + "\"矮人\t184\"\n" + "\n" + "\"泰姆瑞尔的迷失种族，卷一\t184\"\n" + "\n" + "\"泰姆瑞尔的迷失种族，卷二\t185\"\n" + "\n" + "\"泰姆瑞尔的迷失种族，卷三\t186\"\n" + "\n" + "\"巴兰兹雅传\t188\"\n" + "\n" + "\"卷一\t188\"\n" + "\n" + "\"卷二\t189\"\n" + "\n" + "\"卷三\t191\"\n" + "\n" + "\"白漫城礼仪指南\t193\"\n" + "\"贝萝绮女士的言辞与哲理\t195\"\n" + "\"兵器附魔大全\t199\"\n" + "\"冰与壳\t201\"\n" + "\"奥术复原：手册\t204\"\n" + "\"奥拉夫与龙\t205\"\n" + "\"矮人法律探源\t207\"\n" + "\"暗影标记\t208\"\n" + "\"奥杜因是真实存再的，\t210\"\n" + "\"他不事阿卡托什\t210\"\n" + "\"奥拉夫与龙\t211\"\n" + "\"奥杜因与阿卡托什的双重性\t213\"\n" + "\"风舵城书信集\t215\"\n" + "\"疯病的十六种症状\t218\"\n" + "\n" + "\"卷六\t218\"\n" + "\n" + "\"卷九 瓦尔迷纳的传说\t219\"\n" + "\n" + "\"狼女王传\t222\"\n" + "\"狼女王\t226\"\n" + "\n" + "\"卷一\t226\"\n" + "\n" + "\"卷二\t231\"\n" + "\n" + "\"卷三\t234\"\n" + "\n" + "\"卷四\t240\"\n" + "\n" + "\"卷五\t244\"\n" + "\n" + "\"卷六\t247\"\n" + "\n" + "\"卷七\t250\"\n" + "\n" + "\"卷八\t253\"\n" + "\n" + "\"狼人的体貌与特性的实验\t257\"\n" + "\"林中小屋\t259\"\n" + "\n" + "\"卷二\t259\"\n" + "\n" + "\"炼金术士之歌\t261\"\n" + "\"锻莫的古老传说五\t261\"\n" + "\"凯米尔·泽废墟\t263\"\n" + "\"巨石之城：马卡斯佣兵指南\t270\"\n" + "\"克拉特利庄园传说\t272\"\n" + "\"酷伯与巨龙\t280\"\n" + "\"流浪者之死\t284\"\n" + "\"龙飞于此\t286\"\n" + "\"尼克姆的事故\t288\"\n" + "\"奈恩根记录 修订版\t291\"\n" + "\"尼瑞瓦的星与月\t293\"\n" + "\"逆时针\t294\"\n" + "\"诺德亡灵之间\t298\"\n" + "\"诺德崛起！\t299\"\n" + "\"莫须有的背叛\t301\"\n" + "\"魔族之书\t306\"\n" + "\"龙语大揭秘\t307\"\n" + "\"龙裔之书\t311\"\n" + "\"玛拉凯斯法典\t313\"\n" + "\"美德的金缎带\t314\"\n" + "\"魔族的种类\t317\"\n" + "\"魔族的灵魂\t320\"\n" + "\"巨石守护者\t321\"\n" + "\"巨龙战争\t322\"\n" + "\"黑色的悲剧\t324\"\n" + "\"赫洛米尔歌集\t325\"\n" + "\"黑矢\t333\"\n" + "\n" + "\"卷一\t333\"\n" + "\n" + "\"卷二\t337\"\n" + "\n" + "\"红山之战及审判席的兴衰\t340\"\n" + "\"红色谜语书\t344\"\n" + "\"行走天下\t345\"\n" + "\n" + "\"卷十一 独孤城\t345\"\n" + "\n" + "\"海象的袭击\t349\"\n" + "\"归来之歌\t349\"\n" + "\n" + "\"卷二\t349\"\n" + "\n" + "\"归来之歌\t351\"\n" + "\n" + "\"卷七\t351\"\n" + "\n" + "\"疯病的十六种症状\t353\"\n" + "\n" + "\"卷十二\t353\"\n" + "\n" + "\"归来之歌\t357\"\n" + "\n" + "\"卷十九\t357\"\n" + "\n" + "\"卷二十四\t358\"\n" + "\n" + "\"卷五十六\t359\"\n" + "\n" + "\"高级撬锁\t360\"\n" + "\"红鹰的传说\t361\"\n" + "\"加卢斯·戴西迪里奥斯的日记\t363\"\n" + "\"加列昂神话\t364\"\n" + "\"嫁妆\t365\"\n" + "\"镜\t367\"\n" + "\"交叉匕首：裂谷城历史\t371\"\n" + "\"获取霜蛛毒\t372\"\n" + "\"火中舞\t373\"\n" + "\n" + "\"卷一\t373\"\n" + "\n" + "\"卷二\t377\"\n" + "\n" + "\"卷三\t383\"\n" + "\n" + "\"卷四\t389\"\n" + "\n" + "\"卷五\t394\"\n" + "\n" + "\"卷六\t400\"\n" + "\n" + "\"卷七\t405\"\n" + "\n" + "\"灰色广场的灾祸\t410\"\n" + "\"护甲师的挑战\t411\"\n" + "\"裴伦纳尔之歌\t414\"\n" + "\n" + "\"卷六\t414\"\n" + "\n" + "\"马卡斯城家庭装饰指南\t415\"\n" + "\"元气满满的亚龙人女仆\t415\"\n" + "\n" + "\"卷一\t416\"\n" + "\n" + "\"卷二\t416\"\n" + "\n" + "\"传奇的灾难\t417\"\n" + "\"丹莫人的祖先\t417\"\n" + "\"第一议会之战\t421\"\n" + "\"天际省草药师指南\t422\"\n" + "\"古老之道\t425\"\n" + "\"挂毯访谈录\t426\"\n" + "\n" + "\"第十八卷 切瑞姆的阿纳奎那之心\t426\"\n" + "\n" + "\"附魔师入门指南\t428\"\n" + "\"正义的瑞斯拉夫\t429\"\n" + "\"白漫城家庭装饰指南\t434\"\n" + "\"裂谷城家庭装饰指南\t435\"\n" + "\"独孤城家庭装饰指南\t435\"\n" + "\"新的威胁\t436\"\n" + "\n" + "\"卷一\t437\"\n" + "\n" + "\"卷二\t439\"\n" + "\n" + "\"卷三\t440\"\n" + "\n" + "\"卷四\t441\"\n" + "\n" + "\"维纳科斯和波罗尔\t443\"\n" + "\"马卡斯之熊\t447\"\n" + "\"黄色谜语书\t448\"\n" + "\"奈恩之魂\t449\"\n" + "\"天际省的诺德人\t450\"\n" + "\"逃离梭默的魔爪\t451\"\n" + "\"母亲的吻\t458\"\n" + "\"黑暗之星\t459\"\n" + "\"亚历德王国城市研究：瓦沙·巴林和奈法瑞维冈\t459\"\n" + "\"持有证明\t460\"\n" + "\"奥拉夫国王之诗\t460\"\n" + "\"阿达巴尔·阿\t461\"\n" + "\"神龙卫编年史\t463\"\n" + "\"欧普斯库鲁斯·拉马·巴尔·塔·梅扎莫提\t464\"\n" + "\"帕拉\t465\"\n" + "\n" + "\"卷一\t465\"\n" + "\n" + "\"卷二\t469\"\n" + "\n" + "\"破晓神教注解\t474\"\n" + "\n" + "\"卷一\t474\"\n" + "\n" + "\"卷二\t476\"\n" + "\n" + "\"卷三\t477\"\n" + "\n" + "\"卷四\t478\"\n" + "\n" + "\"贪得无厌的贼\t479\"\n" + "\"泰姆瑞尔的诸神与信仰概述\t483\"\n" + "\"天际省探险指南\t484\"\n" + "\"天降魔法\t486\"\n" + "\"韦德留斯·加瑟林的日记\t488\"\n" + "\"瓦巴杰克\t489\"\n" + "\"塔拉让公主之谜\t490\"\n" + "\n" + "\"卷一\t490\"\n" + "\n" + "\"卷二\t495\"\n" + "\n" + "\"卷三\t499\"\n" + "\n" + "\"卷四\t503\"\n" + "\n" + "\"卷五\t508\"\n" + "\n" + "\"狩猎三眼巨魔\t511\"\n" + "\"神秘主义者加里昂\t514\"\n" + "\"轻甲熔炼\t515\"\n" + "\"前线、征服与和解\t515\"\n" + "\"桑·卡托之战\t517\"\n" + "\"身败名裂\t518\"\n" + "\"哨兵夜降\t519\"\n" + "\"显圣\t523\"\n" + "\"夜莺\t527\"\n" + "\n" + "\"卷一 我们是谁\t527\"\n" + "\n" + "\"卷二 我们是什么\t528\"\n" + "\n" + "\"族母阿尼西的旨意\t530\"\n" + "\"卓兹拉的传说 注译版\t533\"\n" + "\"最后一课\t535\"\n" + "\"裴伦纳尔之歌\t538\"\n" + "\n" + "\"卷三 英雄之敌\t538\"\n" + "\n" + "\"重甲熔炼\t539\"\n" + "\"种族进化和生物学笔记 第七版\t540\"\n" + "\"战争魔法之艺术\t541\"\n" + "\"遗弃之地是如何落入兽族之手\t542\"\n" + "\"尤里尔·塞普汀七世生平\t546\"\n" + "\"再探沉睡净土\t548\"\n" + "\"战士冲锋\t550\"\n" + "\"扎雷克的赎金\t551\"\n" + "\n" + "\"卷一\t551\"\n" + "\n" + "\"月之熔炉\t554\"\n" + "\"乞丐\t554\"\n" + "\"位置的重要性\t557\"\n" + "\"奇玛瓦米迪尤姆\t559\"\n" + "\"天空之子\t561\"\n" + "\"沃夫马尔的高级盗窃指南\t562\"\n" + "\"无尽黑暗\t564\"\n" + "\"五年战争中的多兵种作战策略\t565\"\n" + "\n" + "\"卷一\t566\"\n" + "\n" + "\"无上美味美食家著\t567\"\n" + "\"天际省约法：外来者的见解\t570\"\n" + "\"天际省各据点——校级军官的指南\t571\"\n" + "\"天际省歌集 修订版\t574\"\n" + "\"天际省的丹莫人\t577\"\n" + "\"探秘雪精灵\t578\"\n" + "\"天际省的狼人传说\t580\"\n" + "\"天际省的猫类\t581\"\n" + "\"天际省的失落传说\t582\"\n" + "\"武夫哈斯国王的五首歌\t584\"\n" + "\"西科瑞达尔的空中花园\t588\"\n" + "\"雪王子的陨落\t588\"\n" + "\"学徒的助手\t590\"\n" + "\"亚历德废墟中的荣耀与悲歌\t592\"\n" + "\"亚历德族的最后一位国王\t594\"\n" + "\"亚龙人轶事\t595\"\n" + "\n" + "\"卷一\t595\"\n" + "\n" + "\"卷二\t600\"\n" + "\n" + "\"卷三\t604\"\n" + "\n" + "\"卷四\t608\"\n" + "\n" + "\"星灵异教\t613\"\n" + "\"限时桥\t617\"\n" + "\"先祖蛾教派的法则\t618\"\n" + "\"小迷宫 沙利多和“迷城”\t619\"\n" + "\"谢尔格拉神话\t621\"\n" + "\"辛德莱昂的冒险日记\t624\"\n" + "\"探究锻莫人\t626\"\n" + "\n" + "\"卷一 建筑与文明\t626\"\n" + "\n" + "\"卷二 建筑与文明\t628\"\n" + "\n" + "\"杀戮吧——给自己一条活路\t631\"\n" + "\"三个小偷\t633\"\n" + "\"上古卷轴的统计\t636\"\n" + "\"上古卷轴的作用\t638\"\n" + "\"神秘的阿卡维尔大陆\t640\"\n" + "\"上锁的房间\t642\"\n" + "\"萨瑟尔城的陷落\t644\"\n" + "\"熔炉，匠锤与铁砧\t645\"\n" + "\"乞丐王子\t647\"\n" + "\"奇玛瓦米迪尤姆\t649\"\n" + "\"钱斯的愚蠢\t652\"\n" + "\"轻声步履：天际诺德废墟\t654\"\n" + "\"权杖的艺术\t656\"\n" + "\"神射手课程\t657\"\n" + "\"神圣马鲁克兄弟会编年史\t660\"\n" + "\n" + "\"卷一 教堂净化\t660\"\n" + "\n" + "\"塔洛斯之谬\t661\"\n" + "\"苔原行者颂\t662\"\n" + "\"碎片：有关阿塔尤姆\t663\"\n" + "\"水中呼吸\t664\"\n" + "\"实用制锁原理\t667\"\n" + "\"圣者艾莱西亚的考验\t668\"\n" + "\"试验黑魔法\t669\"\n" + "\"狩猎仪式\t672\"\n" + "\"双子的秘密\t674\"\n" + "\"兽人的起源\t675\"\n" + "\"帝国上古议会对艾俄尼斯灾难的报告\t676\"\n" + "\"德·瑞茹姆·迪仁尼\t683\"\n" + "\"帝王之坠\t686\"\n" + "\"国王\t687\"\n" + "\"黑暗兄弟\t692\"\n" + "\"赫伯恩寓言：矮人自走人\t693\"\n" + "\"盗贼\t695\"\n" + "\"大事纪：卷一\t698\"\n" + "\"布拉维尔 尼本之女\t701\"\n" + "\"裴伦纳尔之歌\t703\"\n" + "\n" + "\"卷一\t704\"\n" + "\n" + "\"谢扎尔和圣灵们\t704\"\n" + "\"湮灭之水\t706\"\n" + "\"边塞领的“疯汉”\t706\"\n" + "\"被窃的阴影\t708\"\n" + "\n" + "\"卷一\t708\"\n" + "\n" + "\"卷二\t709\"\n" + "\n" + "\"黑白的灵魂\t711\"\n" + "\"曼尼马克 蛆虫之王\t712\"\n" + "\"梦魇行者\t716\"\n" + "\"难民\t717\"\n" + "\"尼本之父\t722\"\n" + "\"龙破 修订版\t729\"\n" + "\"勒多兰家的希望\t730\"\n" + "\"火与暗\t733\"\n" + "\"后卫\t736\"\n" + "\"霍格德的传说\t739\"\n" + "\"恐怖的夏尔城堡\t742\"\n" + "\"九圣灵骑士团\t749\"\n" + "\"裴伦纳尔之歌\t751\"\n" + "\n" + "\"卷五\t751\"\n" + "\n" + "\"卷四\t752\"\n" + "\n" + "\"有关湮灭\t753\"\n" + "\"有关佛乔里和霍吉尔\t754\"\n" + "\"原创世之后代\t755\"\n" + "\"元神话\t757\"\n" + "\"幽魂之母：两种理论\t765\"\n" + "\"幽魂的嫁妆\t767\"\n" + "\"英格尔与海鬼\t770\"\n" + "\"湮灭之门\t770\"\n" + "\"湮灭危机\t775\"\n" + "\"野精灵\t778\"\n" + "\"夜母的真面目\t779\"\n" + "\"夜莺：是真是假？\t781\"\n" + "\"月影洛克汗\t782\"\n" + "\"在阿特尤姆上\t783\"\n" + "\"赫伯恩寓言：冰怨灵\t784\"\n" + "\"最后的阿卡拉什剑鞘\t785\"\n" + "\"赫伯恩寓言：乌鸦鬼婆\t789\"\n" + "\"裴伦纳尔之歌\t790\"\n" + "\n" + "\"卷二\t790\"\n" + "\n" + "\"卷七\t791\"\n" + "\n" + "\"卷八\t792\"\n" + "\n" + "\"猪童\t793\"\n" + "\"种子\t794\"\n" + "\"战友团伟大的先驱者们\t797\"\n" + "\"战士\t799\"\n" + "\"真实的巴兰兹雅\t801\"\n" + "\n" + "\"卷一\t801\"\n" + "\n" + "\"卷二\t811\"\n" + "\n" + "\"卷三\t822\"\n" + "\n" + "\"卷四\t832\"\n" + "\n" + "\"卷五\t842\"\n";
		String[] arr = str.split("\n");
		int i = 0;
		String title = "";
		boolean flag = false;
		int j = 0;
		int a = 0;
		for (String s : arr) {
			if (StringUtils.isNotBlank(s)) {
				String[] sArr = s.split("\t");
				if (sArr.length == 1) {
					System.out.println("error");
					break;
				}
				s = sArr[0].substring(1);
				if (s.startsWith("卷")) {
					flag = true;
					System.out.println(title + "，" + s);
				} else if (flag) {
					flag = false;
					title = s;
				} else {
					// System.out.println(title);
					title = s;
				}
				i++;
//				if (s.startsWith("卷")) {
////					a++;
//					if (i != j + 1) {
//						a--;
//					}
//					j = i;
//					System.out.print(j + " ");
//					System.out.println(s);
//				}
			}
		}
		System.out.println(i);
		System.out.println(a);
	}
}













